testing/MOM/noBreakupAndCoalescence/constant/phaseProperties
// -*- C++ -*-
// File generated by PyFoam - sorry for the ugliness

FoamFile
{
 version 2.0;
 format ascii;
 class dictionary;
 location "constant";
 object phaseProperties;
}

phases
  (
    air
    water
  );

air
{
  diameterModel PBEDiameter;
  PBEDiameterCoeffs
  {
    method methodOfMoments;
    MOMCoeffs
    {
          scaleDiameter 	0.001; 		//scaling factor or diameter
          maxDiameter		0.006;		//maximum allowed diameter
          minDiameter		0.0001;		//minimum allowed diameter
          //--------------------------parameters with default values
          maxGammaBeta	65.0; 			//default 10, maximum allowed beta parameter in gamma distribution
          minGammaAlpha	1e-04; 			//default 1e-05; minimum allowed alpha parameter in gamma distribution
          maxDiameterMultiplicator	3; 	//default 10, integration is from zero to maxD = maxDiameterMultiplicator * mean diameter
          integrationSteps		20; 	//default 10, numer of integration steps for numerical integration of source terms
          //daughterDropletsNr	2; 		//default 2, number of daughter droplets
          scaleM3	1;			//default 1.0, additional scaling factor for third moment only
    }
    coalescenceKernel noCoalescence;
    breakupKernel binaryBreakup;
    daughterParticleDistribution uniformBinaryBreakup;
    noCoalescenceCoeffs
    {
    }
    noBreakupCoeffs
    {
    }
    binaryBreakupCoeffs
    {
    }
    uniformBinaryBreakupCoeffs
    {
    }
  }
}

water
{
  diameterModel constant;
  constantCoeffs
  {
    d 0.0001;
  }
}

blending
{
  default
  {
    type none;
    continuousPhase water;
  }
}

sigma
  (

    (
      air
      and
      water
    )
    0.07
  );

aspectRatio
  (

    (
      air
      in
      water
    )

    {
      type constant;
      E0 1.0;

    }
  );

drag
  (

    (
      air
      in
      water
    )

    {
      type SchillerNaumann;
      residualAlpha 1e-06;
      residualRe 0.001;
      swarmCorrection
      {
        type none;
      }

    }
  );

virtualMass
  (

    (
      air
      in
      water
    )

    {
      type constantCoefficient;
      Cvm 0.5;

    }
  );

heatTransfer
  (

    (
      air
      in
      water
    )

    {
      type RanzMarshall;
      residualAlpha 0.0001;

    }
  );

lift
  (
  );

wallLubrication
  (
  );

turbulentDispersion
  (
  ); 	// Minimum allowable pressure

pMin 10000; 	// ************************************************************************* //

